# GetAllUnits Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitUtils..::..GetAllUnits Method
UnitUtils Class See Also
---
Gets the identifiers of all available units.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static IList<ForgeTypeId> GetAllUnits()
```

Visual Basic
---
```text
Public Shared Function GetAllUnits As IList(Of ForgeTypeId)
```

Visual C++
---
```text
public:
static IList<ForgeTypeId^>^ GetAllUnits()
```

# ### Return Value
The unit identifiers.
# See Also
UnitUtils Class
Autodesk.Revit.DB Namespace